Revit 2027 API
OptionalFunctionalityUtils.IsSKPImportLinkAvailable Method
 Checks whether the SKP Import/Link functionality is available in the installed Revit.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsSKPImportLinkAvailable()
Public Shared Function IsSKPImportLinkAvailable As Boolean
public:
static bool IsSKPImportLinkAvailable()
static member IsSKPImportLinkAvailable : unit -> bool
Return Value
Boolean
 True if the SKP Import/Link functionality is available in the installed Revit.
Remarks
 SKP Import/Link is optional functionality that does not have to be part of the Revit installation.
See Also
Reference
OptionalFunctionalityUtils Class
Autodesk.Revit.DB Namespace